{
  "peft_type": "LORA",
  "base_model_name_or_path": "microsoft/phi-3-mini-4k-instruct",
  "r": 4,
  "lora_alpha": 8,
  "lora_dropout": 0.05,
  "bias": "none",
  "task_type": "CAUSAL_LM",
  "target_modules": ["q_proj", "k_proj", "v_proj", "o_proj"]
}
